providers/Sources/src/InternalNews/InternalNewsSource.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="InternalNewsSource" targetNamespace="http://modalis.i3s.unice.fr/jSeduite/sources/wsdl/InternalNewsSource"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://modalis.i3s.unice.fr/jSeduite/sources/wsdl/InternalNewsSource" xmlns:ns="http://modalis.i3s.unice.fr/jSeduite/providers/schema/Information" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://modalis.i3s.unice.fr/jSeduite/sources/wsdl/InternalNewsSource" xmlns:ns0="http://modalis.i3s.unice.fr/jSeduite/providers/schema/Information/InternalNews">
            <xsd:import namespace="http://modalis.i3s.unice.fr/jSeduite/providers/schema/Information" schemaLocation="../AbstractSource.xsd"/>
            <xsd:import schemaLocation="InternalNewsSource.xsd" namespace="http://modalis.i3s.unice.fr/jSeduite/providers/schema/Information/InternalNews"/>
        </xsd:schema>
    </types>
    <message name="GetInfosRequest">
        <part name="in" element="ns:GetInformationRequest"/>
    </message>
    <message name="GetInfosResponse">
        <part name="out" element="ns:GetInformationResponse"/>
    </message>
    <portType name="InternalNewsSourcePortType">
        <operation name="GetInfos">
            <input name="input1" message="tns:GetInfosRequest"/>
            <output name="output1" message="tns:GetInfosResponse"/>
        </operation>
    </portType>
    <binding name="InternalNewsSourceBinding" type="tns:InternalNewsSourcePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="GetInfos">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="InternalNewsSourceService">
        <port name="InternalNewsSourcePort" binding="tns:InternalNewsSourceBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/InternalNewsSourceService/InternalNewsSourcePort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="InternalNewsSource">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="InternalNewsSourcePortTypeRole" portType="tns:InternalNewsSourcePortType"/>
    </plnk:partnerLinkType>
</definitions>
