jSeduiteBpelComponent/test/Sources-ImageScraperSource-GetInfos/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inf="http://modalis.i3s.unice.fr/jSeduite/providers/schema/Information">
  <soapenv:Body>
    <inf:GetInformationRequest>
      <inf:identifier>full_test</inf:identifier>
    </inf:GetInformationRequest>
  </soapenv:Body>
</soapenv:Envelope>